هلا صديقي شلونك
هاي رسالة كاتبه الك المبرمج اوسكار
اذا انت تريد تصير مبرمج

أول مره رأح تبدي تسأل اكيد؟
: والكل طبعا راح يكلك
{فاشل…ماتنجح…ههههه…مستحيل}
والخ من هاذا الكلام العباره
عن كلام يعكس المتكلمم لانه هوه الفاشل

كل هاي الانتقادات هيه الي راح تحكم عليك
هسه تكول شلون لانو اذا الحجي أثر عليك وبطلت
ا نت هناا حقأ فاشل اما اذا ستمريت انت بطل

اول خطوه حته تنجح اختر لغه البرمجه الي تناسبك
ثاني خطوه لاتقارن روحك وياه شخص خليك نفسك
ثالثا خطوه واهم خطوه هاي اهم شي مهمه جداً

{استمر حتئ بعد الفشل المستمر}

من تفشل انته هنا حققت نص حلمك
وشكد ماتفشل اعتبره انجاز وخلي هدفك
نجأح حد ماتنجح

ولان خطوه ايضا جداً مهمه

{حتى تنجح تحتاج واهس قوي}

اذا ماعندك واهس لا تبدأ اصلا
ولان كيف تحصل على الواهس؟

سهله فكر بـ $ وفكر بالشهره
وفكر انك شخص مهم بألمجتمع
لان مجتمعنه هاذا معتمد على تكنلوجيه
بنسبه 80 بالمئه

ومن تسوي شئ وتنجح افرح بسـ لا تكول خلاص كملت الهدف لا هيج خطأ جداً

وكت تنجح بشي حاول طوره الى ان يصل
الى هاهيه تطويره وبعدين ابدي طور بنفسك

مثلا اتعلم لغات اكثرر واكثرر
واهم شي اذا ماعرفت شي اسأل
واذا سألت وماحصلت كوكل موجود
ويوتيوب موجوده والي يسأل مايضيع

هسه تكول اني شخص عادي ماكدر اصير مبرمج
حته نكليزي ماعرف ههه ايضا عادي

الله يكول ادعو وبعدين اسعو 💓😌

بمعنا توكل على الله وابدي مسيرتك
ولا تستسلم لاصعب ضروف

واذا وصلت وختمت لغه الي تعلمته
هنا اكبر خطأ انو تبدي تهمل نفسك

لاهنا لازم تبدي طور وتحدث نفسك وافكارك الى ما نهايه

وهااذا كلشي وشكرا جداً اذا قرأت كل هاذا

💓😌 كتابه اوسكار
